fonecmid-diplom/src/Catalogs/ВКМ_Сотрудники/ВКМ_Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВКМ_Сотрудники</name>
  <attributes>
    <name>Категория</name>
    <type>
      <types>EnumRef.ВКМ_КатегорияСотрудника</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НикВТелеграмм</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентОтРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/ВКМ_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_УсловияОплатыСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентОтРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КатегорияСотрудника</name>
    <type>
      <types>EnumRef.ВКМ_КатегорияСотрудника</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/Catalogs/ВКМ_Сотрудники/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ВКМ_УсловияОплатыСотрудников.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Сотрудник.Установить(Ссылка);
	НаборЗаписей.Отбор.Период.Установить(НачалоМесяца(ТекущаяДатаСеанса()));
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	ЗаписьРегистра = НаборЗаписей.Добавить();
	ЗаписьРегистра.Период = ТекущаяДатаСеанса();
	ЗаписьРегистра.Сотрудник = Ссылка;
	ЗаписьРегистра.КатегорияСотрудника = Категория;
	ЗаписьРегистра.Оклад = Оклад;
	ЗаписьРегистра.ПроцентОтРабот = ПроцентОтРабот;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти
